app/Controllers/Dosen.php

SELECT *
FROM `dosen`
ORDER BY `nama_dosen` ASC
---
    public function index()
    {
        $data = $this->model->orderBy('nama_dosen', 'asc')->findAll();