app/Controllers/Kelas.php

    public function index()
    {
        $data = $this->model->orderBy('nama_kelas', 'asc')->findAll();
---
SELECT *
FROM `kelas`
ORDER BY `nama_kelas` ASC

    public function update($kode_kelas = null)
    {
        $data = $this->request->getRawInput();
        $data['kode_kelas'] = $kode_kelas;

        // Pastikan data dengan NPM ada sebelum update
        $isExists = $this->model->where('kode_kelas', $kode_kelas)->first();
        if (!$isExists) {
            return $this->failNotFound("Data tidak ditemukan untuk kode_kelas $kode_kelas");
        }

        // Gunakan update() dengan where()
        if ($this->model->where('kode_kelas', $kode_kelas)->set($data)->update()) {
---
SELECT *
FROM `kelas`
WHERE `kode_kelas` = 'KLS04'
 LIMIT 1
UPDATE `kelas` SET `nama_kelas` = 'Teknik Mesin A'
WHERE `kode_kelas` = 'KLS04'

    public function delete($kode_kelas)
    {
        $data = $this->model->where('kode_kelas', $kode_kelas)->findAll();

        if ($data) {
            $this->model->where('kode_kelas', $kode_kelas)->delete(); // Perbaikan metode delete()
---
SELECT *
FROM `kelas`
WHERE `kode_kelas` = 'KLS05'
DELETE FROM `kelas`
WHERE `kode_kelas` = 'KLS05'