app/Controllers/Prodi.php

    public function update($id_prodi = null)
    {
        $data = $this->request->getRawInput();
        $data['id_prodi'] = $id_prodi;

        // Pastikan data dengan NPM ada sebelum update
        $isExists = $this->model->where('id_prodi', $id_prodi)->first();
        if (!$isExists) {
            return $this->failNotFound("Data tidak ditemukan untuk id_prodi $id_prodi");
        }

        // Gunakan update() dengan where()
        if ($this->model->where('id_prodi', $id_prodi)->set($data)->update()) {
---
SELECT *
FROM `prodi`
WHERE `id_prodi` = '6'
 LIMIT 1
UPDATE `prodi` SET `nama_prodi` = 'D3 - RKS', `id_prodi` = '6'
WHERE `id_prodi` = '6'